---
kind: property
id: P:Autodesk.Revit.DB.RoutingCondition.Diameter
zh: 直径、管径
source: html/374b49ea-12df-47a2-fa69-761a01b42263.htm
---
# Autodesk.Revit.DB.RoutingCondition.Diameter Property

**中文**: 直径、管径

The diameter of the segment or fitting specified for the routing condition.

## Syntax (C#)
```csharp
public double Diameter { get; }
```